---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.GroundConductorsNumber
source: html/eba2bd38-32b6-0554-92c7-20d1eff44fa3.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.GroundConductorsNumber Property

The GroundConductors Number of the Electrical System.

## Syntax (C#)
```csharp
public int GroundConductorsNumber { get; }
```

## Remarks
This property is used to retrieve the GroundConductors Number of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!